In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series([1,np.nan,3,4,np.nan,6,7,8,9,10])
print(data)

0     1.0
1     NaN
2     3.0
3     4.0
4     NaN
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [5]:
data.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [6]:
data.notnull()

0     True
1    False
2     True
3     True
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [7]:
dictionary={
    0:["p","q","r","s",np.nan],
    1:["a","b","c",np.nan,"e"],
    2:["f","g",np.nan,"i","j"],
    3:["k","l",np.nan,"n","o"]
}
print(dictionary)

{0: ['p', 'q', 'r', 's', nan], 1: ['a', 'b', 'c', nan, 'e'], 2: ['f', 'g', nan, 'i', 'j'], 3: ['k', 'l', nan, 'n', 'o']}

In [8]:
df = pd.DataFrame(dictionary)

In [9]:
df

     0    1    2    3
0    p    a    f    k
1    q    b    g    l
2    r    c  NaN  NaN
3    s  NaN    i    n
4  NaN    e    j    o

In [10]:
df.isnull()

       0      1      2      3
0  False  False  False  False
1  False  False  False  False
2  False  False   True   True
3  False   True  False  False
4   True  False  False  False

In [11]:
df.notnull()

       0      1      2      3
0   True   True   True   True
1   True   True   True   True
2   True   True  False  False
3   True  False   True   True
4  False   True   True   True

In [12]:
df_fill=df.fillna(10)

In [13]:
df_fill

    0   1   2   3
0   p   a   f   k
1   q   b   g   l
2   r   c  10  10
3   s  10   i   n
4  10   e   j   o

In [15]:
df_particular_values=df.fillna({0:"t",1:"d",2:"h",3:"m"})

In [17]:
df_particular_values

   0  1  2  3
0  p  a  f  k
1  q  b  g  l
2  r  c  h  m
3  s  d  i  n
4  t  e  j  o

In [18]:
df_fill_previous_observation=df.fillna(method="ffill")
df_fill_previous_observation

   0  1  2  3
0  p  a  f  k
1  q  b  g  l
2  r  c  g  l
3  s  c  i  n
4  s  e  j  o

In [19]:
df_fil_previous_observation_only_1_limit=df.fillna(method="ffill",limit=1)
df_fil_previous_observation_only_1_limit

   0  1  2  3
0  p  a  f  k
1  q  b  g  l
2  r  c  g  l
3  s  c  i  n
4  s  e  j  o

In [21]:
df_fil_previous_observation_only_2_limit=df.fillna(method="ffill",limit=2)
df_fil_previous_observation_only_2_limit

   0  1  2  3
0  p  a  f  k
1  q  b  g  l
2  r  c  g  l
3  s  c  i  n
4  s  e  j  o

In [22]:
numericdictionary = {
    0:[1,2,3,np.nan],
    1:[6,7,np.nan,np.nan],
    2:[10,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan]
}

In [23]:
df_2 = pd.DataFrame(numericdictionary)

In [24]:
df_2

     0    1     2   3
0  1.0  6.0  10.0 NaN
1  2.0  7.0   NaN NaN
2  3.0  NaN   NaN NaN
3  NaN  NaN   NaN NaN

In [25]:
df_2.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [26]:
df_2.dropna(axis=1,how="all")

     0    1     2
0  1.0  6.0  10.0
1  2.0  7.0   NaN
2  3.0  NaN   NaN
3  NaN  NaN   NaN

In [27]:
df_2.dropna(how="all")

     0    1     2   3
0  1.0  6.0  10.0 NaN
1  2.0  7.0   NaN NaN
2  3.0  NaN   NaN NaN

In [28]:
df2_fill=df_2.fillna(8)
df2_fill

     0    1     2    3
0  1.0  6.0  10.0  8.0
1  2.0  7.0   8.0  8.0
2  3.0  8.0   8.0  8.0
3  8.0  8.0   8.0  8.0

In [29]:
df2_fill=df_2.fillna({0:4,1:8,2:9,3:11})
df2_fill

     0    1     2     3
0  1.0  6.0  10.0  11.0
1  2.0  7.0   9.0  11.0
2  3.0  8.0   9.0  11.0
3  4.0  8.0   9.0  11.0

In [30]:
df2_fill=df_2.fillna(method="ffill")
print(df_2)
df2_fill

     0    1     2   3
0  1.0  6.0  10.0 NaN
1  2.0  7.0   NaN NaN
2  3.0  NaN   NaN NaN
3  NaN  NaN   NaN NaN

     0    1     2   3
0  1.0  6.0  10.0 NaN
1  2.0  7.0  10.0 NaN
2  3.0  7.0  10.0 NaN
3  3.0  7.0  10.0 NaN

In [31]:
df2_fill_mean=df_2.fillna(df_2.mean())
df2_fill_mean

     0    1     2   3
0  1.0  6.0  10.0 NaN
1  2.0  7.0  10.0 NaN
2  3.0  6.5  10.0 NaN
3  2.0  6.5  10.0 NaN

In [32]:
series=pd.Series([100,6,100,3,2,0,100,5,9,10,8])

In [33]:
series

0     100
1       6
2     100
3       3
4       2
5       0
6     100
7       5
8       9
9      10
10      8
dtype: int64

In [34]:
series.replace(100,7)

0      7
1      6
2      7
3      3
4      2
5      0
6      7
7      5
8      9
9     10
10     8
dtype: int64

In [35]:
series2=pd.Series([4,5,6,100,7,8,100,9,10])

In [36]:
series2.replace(to_replace=[5,100,7],value=0)

0     4
1     0
2     6
3     0
4     0
5     8
6     0
7     9
8    10
dtype: int64

In [37]:
series2

0      4
1      5
2      6
3    100
4      7
5      8
6    100
7      9
8     10
dtype: int64

In [38]:
series1=pd.Series([1,2,100,4,5,100,7,8,100])
print(series1)

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [39]:
series1.replace({100:np.nan,1:50})

0    50.0
1     2.0
2     NaN
3     4.0
4     5.0
5     NaN
6     7.0
7     8.0
8     NaN
dtype: float64

In [40]:
series2 = pd.Series(list('abcdeabcd'))

In [41]:
series2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object

In [42]:
pd.get_dummies(series2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1
5  1  0  0  0  0
6  0  1  0  0  0
7  0  0  1  0  0
8  0  0  0  1  0